In [68]:
#1Create a Datatime index containing all the weekdays days of year 2019 and assign a 
#random number to each of them in a dataframe. 
import pandas as pd
pd.date_range('2019-11-01', '2019-11-08', freq=BDay())

DatetimeIndex(['2019-11-01', '2019-11-04', '2019-11-05', '2019-11-06',
               '2019-11-07', '2019-11-08'],
              dtype='datetime64[ns]', freq='B')

In [70]:
pd.bdate_range('2019-11-01', '2019-11-08')

DatetimeIndex(['2019-11-01', '2019-11-04', '2019-11-05', '2019-11-06',
               '2019-11-07', '2019-11-08'],
              dtype='datetime64[ns]', freq='B')

In [71]:
#2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . 
#Create a dataframe with height and weight as column names. 
import pandas as pd
data = {'height':[23,42,55], 'weight':[71,32,55]}
print(pd.DataFrame(data))

   height  weight
0      23      71
1      42      32
2      55      55

In [72]:
#3.How to get the items of series A not present in series B .From ser1 remove items present in ser2.
ser1 = pd.Series([2, 3, 4, 5])
ser2 = pd.Series([5, 6, 7, 8])
ser3 = list(set(ser1) - set(ser2))
ser3

[2, 3, 4]

In [73]:
ser4 = ser1[~ser1.isin(ser2)] 
ser4

0    2
1    3
2    4
dtype: int64

In [80]:
df_tt = pd.read_csv('titanic.csv') #or can give the full path name
df_tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:
#Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset
df_tt.describe().Age

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [76]:
#How to get frequency counts of unique items of a series? 
#Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
df_tt['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [81]:
#Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’
#column of titanic dataset
df_tt['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [83]:
df_tt.loc[df_tt.Embarked == 'Q', 'Embarked'] = 'Other'
df_tt['Embarked'].value_counts()

S        644
C        168
Other     77
Name: Embarked, dtype: int64

In [100]:
#Bin the price column in titanic data set into 5 equal groups and get counts of each bin
df_tt['Fare'].describe()
df_tt['Price_bin'] = pd.cut(df_tt['Fare'], [0, 125, 250, 375, 500, 625],
                           labels =['0-125', '125-250', '250-375', '375-500', '500-625'])
df_tt['Price_bin'].value_counts()

0-125      838
125-250     29
250-375      6
500-625      3
375-500      0
Name: Price_bin, dtype: int64

In [102]:
# Count the number of missing values in each column?
df_tt.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Price_bin       15
dtype: int64

In [114]:
#Get the row number of the 5th largest value in the Age column of titanic dataset?
df_tt.nlargest(5,'Age').

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Price_bin
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,0-125
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,0-125
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,0-125
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,0-125
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Other,0-125

In [128]:
df_tt.loc[df_tt['Age'].idxmax()]

'Age'

In [122]:

normalized_df=(df-df.mean())/df.std()

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: Age, dtype: int64